Courses/7370/Lectures/Overview/TBD/lecture-one.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-23 Mon 10:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DistrComp  Course Overview</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti's Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2020-01-01 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">DistrComp  Course Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd4be874">1. Course Overview</a></li>
<li><a href="#org4b5916e">2. Today's Lecture</a></li>
<li><a href="#orgb382c6c">3. Home Work</a></li>
<li><a href="#orgd205348">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4be874" class="outline-2">
<h2 id="orgd4be874"><span class="section-number-2">1</span> Course Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>WSU CEG7370 <a href="https://cecs.wright.edu/~pmateti/Courses/7370/Top/">Distributed Computing</a> Course Home Page</li>
<li><a href="./syllabus.html">Syllabus</a> of the IIIT-Delhi version of this course</li>
<li><a href="../Projects/7370projects.html">Projects</a></li>
<li>Two exams. Most likely <a href="../../Exams/index.html">take-home</a>.  But, without searching the web or
whatever for answers.</li>

<li>No graded homework.  Implies that you will work on
various things on your own and discuss.</li>
<li><a href="https://piazza.com/wright/spring2020/ceg7370/home">Piazza</a> is our discussion platform.</li>

<li><a href="./andrews-multithreaded-toc.html">./andrews-multithreaded-toc.html</a> Andrews Book.  Noted: Excluded
chapters and sections.  We do cover things not included in this
book.</li>
</ol>
</div>
</div>

<div id="outline-container-org4b5916e" class="outline-2">
<h2 id="org4b5916e"><span class="section-number-2">2</span> Today's Lecture</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org945456d" class="outline-3">
<h3 id="org945456d"><span class="section-number-3">2.1</span> Terminology</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>We are picky about our terms.</li>
<li>Ex: "Process"
<ol class="org-ol">
<li>Conceptutally the same: process, thread, task, job, &#x2026;</li>
<li>On a given platform (e.g., Linux): process v thread v &#x2026; are different</li>
<li>By def: a single process is sequential</li>
</ol></li>

<li>Muliprocess v Multiprocessor v Multi-core</li>

<li>Until the last week of this course, we will use "concurrency" as a
term covering all of networked-, parallel-, distributed- computing.</li>
</ol>
</div>
</div>


<div id="outline-container-org3dbb829" class="outline-3">
<h3 id="org3dbb829"><span class="section-number-3">2.2</span> Concurrency Fundamentals</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="../Fundas/concurrency-fundamentals.html">../Fundas/concurrency-fundamentals.html</a></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgb382c6c" class="outline-2">
<h2 id="orgb382c6c"><span class="section-number-2">3</span> Home Work</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Learn the Mine Sweeper game.</li>
<li>Study today's lecture.</li>
<li>Enroll and post on Piazza the <a href="../Overview/survey.html">Survey of Prerequisites</a> answered in
some detail.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd205348" class="outline-2">
<h2 id="orgd205348"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<p>
Reading list for this course is a transitive closure starting from the
ones linked on the course home page. Items marked as Require Reading
are sources for exam questions. Other items do enhance your
understanding, but, if you are not aiming for an A, you may skip.
</p>


<ol class="org-ol">
<li>I will list specific chapters from Recommended Books later.</li>
<li>Gregory R. Andrews, Concurrent Programming: Principles and
Practice, Benjamin/Cummings, 1991.  Also see his revision of this book:
<a href="./andrews-multithreaded-toc.html">./andrews-multithreaded-toc.html</a></li>

<li>M. Ben-Ari, Principles of Concurrent and Distributed Programming,
Addison-Wesley/Pearson, 2006.</li>

<li>George Coulouris, Jean Dollimore, Tim Kindberg, and Gordon Blair,
Distributed Systems: Concepts and Design, 2011.</li>

<li>Scala + Akka Documentation, <a href="https://doc.akka.io/docs/akka/current/scala.html">https://doc.akka.io/docs/akka/current/scala.html</a></li>

<li>Java tutorial, <a href="https://download.oracle.com/javase/tutorial/">https://download.oracle.com/javase/tutorial/</a> or
another book of your choice on client/server programming in Java</li>

<li>Other references listed in lectures.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href="https://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2020-01-01
</div>
</body>
</html>
